# FamilyPlacementType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Family..::..FamilyPlacementType Property
Family Class See Also
---
Identifies the type of placement required by a given family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public FamilyPlacementType FamilyPlacementType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FamilyPlacementType As FamilyPlacementType
	Get
```

Visual C++
---
```text
public:
property FamilyPlacementType FamilyPlacementType {
	FamilyPlacementType get ();
}
```

# See Also
Family Class
Autodesk.Revit.DB Namespace